{
  "backend/main.mo": "Main ICP actor implementing a workshop management backend with access-controlled endpoints for user profiles, inventory, service records, customers, and transactions using a mixin authorization pattern.",
  "feature_evidence.json": "Feature evidence report mapping the admin login fix feature to its relevant source files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, describing the purpose and key implementation details of every page, component, and hook.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for a neutral light/dark color theme used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the Workshop POS React app, mounting the app at the `#root` div and loading the Vite entry point.",
  "frontend/src/App.tsx": "Root React component that sets up QueryClient, AuthProvider, and a TanStack Router with three routes (POS, Products, History), conditionally rendering LoginPage when unauthenticated.",
  "frontend/src/components/customer/CustomerEditModal.tsx": "Dialog modal for creating or editing a customer record, including fields for name, phone, discount settings, and a dynamic vehicle history list.",
  "frontend/src/components/layout/MainNav.tsx": "Sticky navigation header with desktop nav links, a mobile menu toggle, shop logo/name from settings, and a user avatar dropdown with logout.",
  "frontend/src/components/pos/CartLineItems.tsx": "Stub no-op component retained only to prevent import errors; the actual cart UI was replaced by TransactionPage.",
  "frontend/src/components/pos/TopNav.tsx": "Top navigation bar component for the POS app with links to POS, Products, and History pages, plus a logout button and current user display.",
  "frontend/src/components/transaction/ReceiptPrint.tsx": "Print-friendly receipt component that renders shop info, transaction details, cart items, and total using shop settings and IDR formatting.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an ICP backend actor (authenticated or anonymous), initializing access control and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAuth.ts": "Authentication context and hook providing login/logout, user management (add/delete/update), and localStorage-backed session persistence with a default admin user.",
  "frontend/src/hooks/useCurrency.ts": "Stub currency hook that provides IDR formatting utilities for compatibility with legacy code.",
  "frontend/src/hooks/useCustomer.ts": "React Query hooks for customer CRUD operations (get all, search by name, upsert, delete) via the ICP backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity authentication provider and hook using DFINITY's AuthClient, exposing identity state, login/clear functions, and login status.",
  "frontend/src/hooks/useInventory.ts": "React Query hooks for inventory item management (get all, add/update, delete) via the ICP backend actor.",
  "frontend/src/hooks/usePersistedDraft.ts": "Stub hook replacing the old draft persistence system; exposes no-op saveDraft and checkout functions for backward compatibility.",
  "frontend/src/hooks/usePosDraft.ts": "Stub hook replacing the old POS draft system; returns a default draft state and no-op action functions to prevent import errors in legacy files.",
  "frontend/src/hooks/useProducts.ts": "Stub hook replacing the old products system; returns empty data and no-op functions for backward compatibility.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for CRUD operations on inventory items, transactions, and service records, using the ICP actor from useActor.",
  "frontend/src/hooks/useReports.ts": "Exports a single React Query hook that fetches a profit/loss report from the backend actor for a given date range.",
  "frontend/src/hooks/useService.ts": "Provides React Query hooks for fetching the service queue, all service records, adding records, and updating service status.",
  "frontend/src/hooks/useShopSettings.ts": "Manages shop settings (name, address, phone, logo, greeting) with localStorage persistence and a React state hook.",
  "frontend/src/hooks/useTransaction.ts": "Provides React Query hooks for fetching all transactions and adding a new transaction via the backend actor.",
  "frontend/src/hooks/useTransactions.ts": "Stub hook that returns empty data, replacing the old transactions hook superseded by useTransaction.ts.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles and a warm amber/ochre CSS custom property theme for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/CustomerDataPage.tsx": "Customer management page supporting search, add/edit/delete, WhatsApp links, and Excel import/export of customer records.",
  "frontend/src/pages/HistoryPage.tsx": "Stub page that renders nothing, replaced by ReportsPage in the new system.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page with a searchable table, add/edit/delete dialog, and Excel import/export for inventory items.",
  "frontend/src/pages/LoginPage.tsx": "Login form page that authenticates users via useAuth hook, displaying username/password fields and error feedback.",
  "frontend/src/pages/PosPage.tsx": "Stub page that renders nothing, replaced by TransactionPage in the new system.",
  "frontend/src/pages/ProductsPage.tsx": "Stub page that renders nothing, replaced by InventoryPage in the new system.",
  "frontend/src/pages/ReportsPage.tsx": "Profit/loss report page that aggregates all transactions into revenue, COGS, and gross profit summaries with itemized sales breakdown, date range filtering (client-side), and print support.",
  "frontend/src/pages/ServicePage.tsx": "Service management page that displays the repair queue and provides a form to add new service records, with status toggling (masuk/selesai) and navigation to the POS page on completion.",
  "frontend/src/pages/SettingsPage.tsx": "Shop settings page allowing users to configure logo, name, address, phone, and greeting message, with all data persisted to localStorage via the useShopSettings hook.",
  "frontend/src/pages/TransactionPage.tsx": "POS/checkout page with customer autocomplete, cart management (add/remove/update items), transaction submission, and receipt printing via window.print().",
  "frontend/src/pages/UserDataPage.tsx": "User management page that lists all workshop users and supports adding new users, deleting existing ones, and uploading profile photos, all stored in localStorage via the useAuth hook.",
  "frontend/src/utils/excelUtils.ts": "Provides CSV import/export utility functions for inventory and customer data, including CSV parsing, escaping, and file download helpers.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL parameters from both query strings and hash-based routing, with sessionStorage persistence and hash cleanup support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, border radius, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks project state at version 3, recording a single existing fix feature targeting broken admin login authentication in useAuth.ts and LoginPage.tsx."
}