{
  "backend/main.mo": "Main actor for a workshop POS backend implementing inventory, service records, customers, transactions, and user profiles with role-based access control (admin/user permissions) and migration support.",
  "backend/migration.mo": "Simple migration module that defines the Actor state shape (nextServiceId, nextTransactionId) and a no-op run function that passes state through unchanged.",
  "feature_evidence.json": "Feature evidence report documenting a single feature fix: correcting the admin role/permission check in ProductsPage.tsx and useUserRole.ts that incorrectly blocked admins from adding new products.",
  "frontend-file-summaries.txt": "A JSON document summarizing each frontend source file's purpose and notable changes, serving as a build/documentation reference for the frontend codebase.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for a neutral light/dark color theme used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the Workshop POS React app, mounting the app at #root and loading the Vite entry point.",
  "frontend/src/App.tsx": "Root React component that sets up QueryClient, AuthProvider, TanStack Router with all page routes (POS, Products, History, Settings, Users, Service, Reports), and conditionally renders LoginPage when unauthenticated.",
  "frontend/src/components/customer/CustomerEditModal.tsx": "Modal dialog for creating or editing a customer record, including fields for name, phone, discount settings, and a dynamic vehicle history list with add/remove controls.",
  "frontend/src/components/layout/MainNav.tsx": "Sticky top navigation bar with shop logo, desktop and mobile nav links for all app routes, and a user avatar dropdown with logout, using TanStack Router for active-link detection.",
  "frontend/src/components/pos/CartLineItems.tsx": "Stub no-op component retained only to prevent import errors; the actual cart UI has been replaced by the TransactionPage cart.",
  "frontend/src/components/pos/TopNav.tsx": "Top navigation bar component for the POS app with links to POS, Products, and History pages, plus a logout button and current user display.",
  "frontend/src/components/transaction/ReceiptPrint.tsx": "Print-friendly receipt component that renders shop info, transaction details, cart items, and total in a monospace 300px layout using shop settings from a hook.",
  "frontend/src/components/user/PermissionsChecklist.tsx": "Renders a checklist of user permissions with checkboxes, and exports constants for all available permissions and role-based default permission sets.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an ICP backend actor based on the current Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Authentication context provider and hook managing workshop users stored in localStorage, supporting login/logout and CRUD operations on users with role migration logic.",
  "frontend/src/hooks/useCurrency.ts": "Stub compatibility hook that provides IDR currency formatting and symbol utilities using the Intl API.",
  "frontend/src/hooks/useCustomer.ts": "React Query hooks for customer data management, providing queries for fetching/searching customers and mutations for upserting and deleting customer records via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity authentication provider and hook built on DFINITY's AuthClient, managing login state, identity persistence, and exposing login/clear functions with status flags.",
  "frontend/src/hooks/useInventory.ts": "React Query mutation hooks for adding, updating, and upserting inventory items via the backend actor, with automatic cache invalidation on success.",
  "frontend/src/hooks/usePersistedDraft.ts": "Stub hook replacing the old draft persistence system, exposing no-op saveDraft and checkout functions for backward compatibility.",
  "frontend/src/hooks/usePosDraft.ts": "Stub hook replacing the legacy POS draft system, returning a default draft state and no-op action functions to prevent import errors in legacy files.",
  "frontend/src/hooks/useProducts.ts": "Stub hook replacing the old products system, returning an empty data array and no-op delete function for backward compatibility.",
  "frontend/src/hooks/useQueries.ts": "Provides standalone React Query hooks for CRUD operations on inventory items, customers, transactions, service records, and profit/loss reports, each using the actor from useActor.",
  "frontend/src/hooks/useReports.ts": "Exports a single React Query hook that fetches a profit/loss report for a given date range from the backend actor.",
  "frontend/src/hooks/useService.ts": "Provides React Query hooks for fetching the service queue, all service records, adding a new service record, and updating a service record's status.",
  "frontend/src/hooks/useShopSettings.ts": "Manages shop settings (name, address, phone, greeting, logo) persisted in localStorage, with a global listener pattern to keep all hook instances in sync.",
  "frontend/src/hooks/useTransaction.ts": "Provides React Query hooks for fetching all transactions and adding a new transaction via the backend actor.",
  "frontend/src/hooks/useTransactions.ts": "Stub hook that returns empty data and isLoading false, replacing the old transactions hook.",
  "frontend/src/hooks/useUserRole.ts": "Fetches the caller's user role from the backend actor using React Query, with retry logic and stale-time configuration.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines a warm amber/ochre CSS custom property theme for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CustomerDataPage.tsx": "Customer management page supporting search, add/edit/delete via modal, WhatsApp links, and Excel import/export of customer records.",
  "frontend/src/pages/HistoryPage.tsx": "Stub page component that renders nothing, replaced by ReportsPage in the current system.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page with a searchable table, add/edit/delete dialogs, CSV import/export, and role-based edit permissions.",
  "frontend/src/pages/LoginPage.tsx": "Renders a login form with username/password fields that calls the `useAuth` hook's `login` function, displaying validation errors and a loading spinner on submission.",
  "frontend/src/pages/PosPage.tsx": "Stub/placeholder component that renders nothing; replaced by TransactionPage in the workshop POS system.",
  "frontend/src/pages/ProductsPage.tsx": "Full CRUD inventory management page with search, add/edit dialog, delete confirmation, and CSV import/export, with role-based access control for admin vs. user operations.",
  "frontend/src/pages/ReportsPage.tsx": "Profit/loss report page that aggregates transaction data into revenue, COGS, and gross profit summaries with an itemized sales table and a print button.",
  "frontend/src/pages/ServicePage.tsx": "Service management page with a form to create new service records and a queue display, supporting status updates (masuk/selesai) and navigation to the transaction page on completion.",
  "frontend/src/pages/SettingsPage.tsx": "Shop settings page allowing users to update store info (name, phone, address), upload/remove a logo (stored as base64), and configure receipt messages, persisted via the `useShopSettings` hook.",
  "frontend/src/pages/TransactionPage.tsx": "Checkout/transaction page that handles customer autocomplete, cart management (add/remove/update items), total calculation, and receipt printing via window.print().",
  "frontend/src/pages/UserDataPage.tsx": "User management page allowing admins to add, edit, and delete workshop users with role selection and granular permissions via a checklist dialog.",
  "frontend/src/utils/excelUtils.ts": "Utility that generates real .xlsx files (Office Open XML/ZIP format) from inventory and customer data using only browser APIs, with no external dependencies.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with sessionStorage persistence and hash-cleanup helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with OKLCH color tokens, border radius variables, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state metadata describing a known bug where the admin role check incorrectly blocks logged-in admin users from adding new products, flagged as a fix request."
}