{
  "backend/main.mo": "Main Motoko actor implementing a workshop management backend with access-controlled endpoints for user profiles, inventory, service records, customers, and transactions using a mixin authorization pattern.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (user management, add/delete user, default admin seeding, photo upload) to their source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file, describing the purpose and key functionality of every component, page, and hook in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for a neutral light/dark color theme used throughout the application.",
  "frontend/index.html": "Minimal HTML shell for the Workshop POS React app, mounting the app into a root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for POS, Products, History, Settings, and Users pages, wrapped in QueryClient and AuthProvider, showing LoginPage when unauthenticated.",
  "frontend/src/components/customer/CustomerEditModal.tsx": "Dialog modal for creating or editing a customer record, including fields for name, phone, discount settings, and a dynamic vehicle history list with add/remove controls.",
  "frontend/src/components/layout/MainNav.tsx": "Sticky top navigation bar with desktop nav links, mobile menu toggle, shop logo/name from settings, and a user dropdown with logout for the workshop app.",
  "frontend/src/components/pos/CartLineItems.tsx": "Stub component that renders nothing, kept only to prevent import errors from legacy code that referenced the old cart component.",
  "frontend/src/components/pos/TopNav.tsx": "Legacy top navigation bar with shop logo, POS/Products/History links, current user display, and a logout button; superseded by MainNav.",
  "frontend/src/components/transaction/ReceiptPrint.tsx": "Print-friendly receipt component that renders shop info, transaction details, itemized cart table, and total in a monospace 300px layout using shop settings.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an ICP backend actor (anonymous or authenticated), initializes access control, and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useAuth.ts": "LocalStorage-backed authentication context providing login/logout, user CRUD, and role management with a seeded default admin account.",
  "frontend/src/hooks/useCurrency.ts": "Stub currency hook that always formats amounts as IDR using Intl.NumberFormat, kept for backward compatibility.",
  "frontend/src/hooks/useCustomer.ts": "React Query hooks for fetching, searching, upserting, and deleting customer records via the ICP backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity authentication provider and hook built on @dfinity/auth-client, exposing identity, login/clear functions, and login status with idle handling disabled by default.",
  "frontend/src/hooks/useInventory.ts": "React Query hooks for listing, adding/updating, and deleting inventory items via the ICP backend actor.",
  "frontend/src/hooks/usePersistedDraft.ts": "Stub hook that replaces the old draft persistence system with no-op functions, kept to avoid import errors in legacy files.",
  "frontend/src/hooks/usePosDraft.ts": "Stub hook replacing the old workshop POS draft system, returning a default empty draft state and no-op action functions.",
  "frontend/src/hooks/useProducts.ts": "Stub hook replacing the old products system, returning an empty data array and no-op delete function.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for CRUD operations on inventory items, transactions, and service records via the backend actor.",
  "frontend/src/hooks/useReports.ts": "React Query hook that fetches a profit/loss report from the backend actor for a given date range.",
  "frontend/src/hooks/useService.ts": "React Query hooks for fetching the service queue, all service records, adding records, and updating service status via the backend actor.",
  "frontend/src/hooks/useShopSettings.ts": "Hook that loads and saves shop settings (name, address, phone, greeting, logo) to localStorage, with cross-instance sync via a global listener set.",
  "frontend/src/hooks/useTransaction.ts": "React Query hooks for fetching all transactions and adding a new transaction via the backend actor.",
  "frontend/src/hooks/useTransactions.ts": "Stub hook replacing the old transactions hook, returning an empty data array and isLoading false.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines a warm amber/ochre CSS custom property theme for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CustomerDataPage.tsx": "Customer data management page supporting search, add/edit/delete, WhatsApp links, and Excel import/export of customer records.",
  "frontend/src/pages/HistoryPage.tsx": "Stub page component that renders nothing, replaced by ReportsPage in the new workshop POS system.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page with a searchable table and dialog for adding/editing items, plus Excel import/export and delete functionality.",
  "frontend/src/pages/LoginPage.tsx": "Renders a login form with username/password fields, calls the `useAuth` hook's `login` function, and displays validation errors or a loading spinner during submission.",
  "frontend/src/pages/PosPage.tsx": "Stub component that renders nothing; replaced by TransactionPage in the workshop POS system.",
  "frontend/src/pages/ProductsPage.tsx": "Stub component that renders nothing; replaced by InventoryPage in the workshop POS system.",
  "frontend/src/pages/ReportsPage.tsx": "Displays a profit/loss report with date range filtering, summary cards (revenue, COGS, gross profit), and an itemized sales table, with a print button that triggers window.print().",
  "frontend/src/pages/ServicePage.tsx": "Manages vehicle service records with a form to add new service entries and a queue display; supports marking services as done and navigating to the transaction page on completion.",
  "frontend/src/pages/SettingsPage.tsx": "Provides a settings form for shop information (name, phone, address, receipt message) and logo upload/preview, persisting changes via the `useShopSettings` hook.",
  "frontend/src/pages/TransactionPage.tsx": "Implements the POS checkout page with inventory item selection, cart management, customer autocomplete, discount handling, and receipt printing via window.print().",
  "frontend/src/pages/UserDataPage.tsx": "React page for user management that displays a table of all users with avatars, roles, and accessibility levels, and provides dialogs for adding new users (with name, username, password, role, accessibility, and photo upload) and deleting existing users with confirmation.",
  "frontend/src/utils/excelUtils.ts": "Utility module providing CSV export and import functions for inventory items and customer records, including CSV parsing, escaping, and file download helpers.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom design tokens (colors via oklch CSS variables, border radius, shadows, animations) and enabling the typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata file tracking the current version, implemented features, known issues, and pending feature requests for the Workshop POS application."
}