{
  "backend/main.mo": "Main Motoko actor implementing a workshop POS backend with access-controlled endpoints for user profiles, inventory, service records, customers, and transactions using a mixin authorization pattern.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features—login authentication fix and LoginPage error boundary—to their relevant source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, describing the purpose of every page, component, and hook in the React application.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for the light and dark color themes used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the Workshop POS React app, mounting the app into a root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all eight page routes, an authentication guard that renders LoginPage when unauthenticated, and a shared AppLayout with MainNav and Toaster.",
  "frontend/src/components/customer/CustomerEditModal.tsx": "Modal dialog for creating or editing a customer record, including fields for name, phone, discount settings, and a dynamic vehicle history list with add/remove controls.",
  "frontend/src/components/layout/MainNav.tsx": "Sticky top navigation bar with links to all seven app pages, active-state highlighting, a shop logo/name display, and a user dropdown menu with logout.",
  "frontend/src/components/pos/CartLineItems.tsx": "Stub component that accepts cart props but renders nothing, kept only to prevent import errors from legacy references.",
  "frontend/src/components/pos/TopNav.tsx": "Navigation bar component for the POS app with three view buttons (Point of Sale, Products, History) that highlights the active view.",
  "frontend/src/components/transaction/ReceiptPrint.tsx": "Print-friendly receipt component that renders shop info, transaction details, cart items, and total in a monospace layout using shop settings from localStorage.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an ICP backend actor, using the current Internet Identity or an anonymous identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Authentication hook managing login/logout state and user CRUD operations (add, delete, update photo) stored in localStorage, with a default admin account.",
  "frontend/src/hooks/useCurrency.ts": "Stub currency hook providing IDR formatting utilities for compatibility with legacy code.",
  "frontend/src/hooks/useCustomer.ts": "React Query hooks for customer data management, exposing get-all, search-by-name, upsert, and delete operations via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity authentication provider and hook that manages AuthClient lifecycle, login/logout flow, and exposes identity state and status flags via React context.",
  "frontend/src/hooks/useInventory.ts": "React Query hooks for inventory management, providing get-all, add/update, and delete operations against the backend actor.",
  "frontend/src/hooks/usePersistedDraft.ts": "Stub hook replacing the old draft persistence system; exposes no-op saveDraft and checkout functions for backward compatibility.",
  "frontend/src/hooks/usePosDraft.ts": "Stub hook replacing the old POS draft system; returns a default draft object and no-op action functions to prevent import errors in legacy files.",
  "frontend/src/hooks/useProducts.ts": "Stub hook replacing the old products system; returns empty data and no-op functions for backward compatibility.",
  "frontend/src/hooks/useReports.ts": "React Query hook that fetches a profit/loss report from the backend actor for a given date range when enabled.",
  "frontend/src/hooks/useService.ts": "React Query hooks for service record management, providing get-queue, get-all, add, and update-status operations against the backend actor.",
  "frontend/src/hooks/useShopSettings.ts": "Hook and utility for reading and persisting shop settings (name, address, phone, logo, greeting) in localStorage with default fallback values.",
  "frontend/src/hooks/useTransaction.ts": "React Query hooks for fetching all transactions and adding a new transaction via the backend actor.",
  "frontend/src/hooks/useTransactions.ts": "Stub/legacy hook that returns empty data, replaced by useTransaction.ts.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines light/dark CSS custom properties for a warm amber/ochre color theme.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CustomerDataPage.tsx": "Customer management page supporting search, add/edit/delete, WhatsApp links, and Excel import/export of customer records.",
  "frontend/src/pages/HistoryPage.tsx": "Stub page that renders nothing, replaced by ReportsPage in the current system.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page with a searchable table, add/edit/delete dialog, and Excel import/export for inventory items.",
  "frontend/src/pages/LoginPage.tsx": "Login page with a username/password form that authenticates against localStorage-stored users and shows error feedback.",
  "frontend/src/pages/PosPage.tsx": "Stub page that renders nothing, replaced by TransactionPage in the current system.",
  "frontend/src/pages/ProductsPage.tsx": "Stub page that renders nothing, replaced by InventoryPage in the current system.",
  "frontend/src/pages/ReportsPage.tsx": "Profit/loss reports page that aggregates transaction and inventory data into revenue, COGS, and per-item sales summaries with date filtering and print support.",
  "frontend/src/pages/ServicePage.tsx": "Service management page that displays a queue of service records and provides a form to add new service entries, with conditional navigation to the transaction page when a service is marked as completed.",
  "frontend/src/pages/SettingsPage.tsx": "Shop settings page allowing users to configure and persist store information (logo, name, address, phone, greeting) to localStorage, with logo upload support.",
  "frontend/src/pages/TransactionPage.tsx": "Transaction/checkout page featuring customer autocomplete, a shopping cart for inventory items, transaction submission, and receipt printing via window.print().",
  "frontend/src/pages/UserDataPage.tsx": "User management page that supports adding and deleting workshop users with profile photo uploads, storing all user data in localStorage.",
  "frontend/src/utils/excelUtils.ts": "Utility module providing CSV export and import functions for inventory items and customer records, including CSV parsing and BOM-prefixed file download helpers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters via sessionStorage and history.replaceState.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens (primary, secondary, sidebar, chart, etc.), border radius variables, accordion keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for a workshop cashier app, recording a known login bug (admin/admin123 fails with 'something went wrong') and two existing fix features targeting authentication logic and LoginPage error handling."
}