{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin role check blocking product addition",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the admin role/permission check that incorrectly blocks logged-in admin users from adding new products in ProductsPage",
      "acceptanceCriteria": [
        "A user logged in as admin can click the 'Add New Product' button without seeing the 'only admin can add new products' error message.",
        "The role check in ProductsPage.tsx correctly reads the admin role from useUserRole or useAuth and grants access.",
        "The backend authorization check (if any) correctly identifies the caller as admin and allows the addInventoryItem or equivalent call to succeed.",
        "Non-admin users (kasir/user roles) still see the appropriate restriction message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProductsPage.tsx",
          "operation": "modify",
          "description": "Fix the admin role check logic that blocks product addition. Review the current role verification implementation (likely using useUserRole or useAuth hooks) and ensure it correctly identifies admin users. The check should use the authorization component's role system to verify admin status before showing the 'only admin can add new products' error. Verify the component's usage instructions before implementing. Ensure the role check properly awaits async role data and handles loading states."
        },
        {
          "path": "frontend/src/hooks/useUserRole.ts",
          "operation": "modify",
          "description": "Review and fix the role detection logic to ensure it correctly fetches and returns the caller's role from the backend. Verify that isAdmin and other role convenience flags are computed correctly from the backend response. Ensure proper handling of loading states and that the hook returns accurate role information when the actor is available. Add error handling for cases where role fetching fails."
        }
      ]
    }
  ]
}