{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add user edit menu for authorization and fix add-product authorization bug",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add Edit button to each user row in UserDataPage that opens a dialog for editing role and permissions",
      "acceptanceCriteria": [
        "Each user row in UserDataPage displays an Edit button or menu option",
        "Clicking Edit opens a modal/dialog pre-filled with the user's current role and permissions",
        "Admin can change the user's role (Admin, User, Kasir) and update their permissions checklist",
        "Saving the edit dialog updates the user's authorization data via useAuth",
        "Changes are reflected immediately in the user list without a page reload"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/UserDataPage.tsx",
          "operation": "modify",
          "description": "Add an Edit button to each user row in the table that opens an edit dialog. Create a new edit dialog (similar to the add dialog) that pre-fills the current user's role and permissions using PermissionsChecklist component. Wire the edit form to call updateUser from useAuth hook with the modified role and permissions. Ensure the dialog is separate from the add-user dialog and handles the pre-population of existing user data correctly."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix authorization check in ProductsPage so Admin users can open the add-product dialog",
      "acceptanceCriteria": [
        "When logged in as Admin, clicking 'Add Product' on the Products page opens the add-product dialog without any authorization error",
        "The authorization guard on the add-product action correctly reads the current user's role from the auth context",
        "Admin and User roles can add products; Kasir role cannot",
        "No false 'no authorization' error is shown to Admin users"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProductsPage.tsx",
          "operation": "modify",
          "description": "Investigate and fix the authorization check that gates the add-product dialog. Review the canEdit logic and ensure it correctly reads the current user's role from useAuth or useUserRole hooks. Verify that the check allows Admin and User roles to proceed with adding products while blocking Kasir role. Remove or correct any faulty permission check that causes the authorization error for Admin users. Ensure the add-product button and dialog opening mechanism properly respect the corrected role-based access control."
        }
      ]
    }
  ]
}